pip install pandas - this is for importing pandas library file 
pip install openxl - this is for importing excel file in jupyter notebook

In [1]:
import pandas as pd

In [3]:
data = {
    'name':['prashant','hello','xyz'],
    'age' :[21,22,45]
}

df = pd.DataFrame(data)
df

       name  age
0  prashant   21
1     hello   22
2       xyz   45

In [6]:
df1 = pd.read_excel('sample.xlsx')
df1

,Name,Age,Gender,Department,Salary,Experience_Years,Joining_Year,Rating
0,Sneha,18,Female,HR,49300,0,2021,3.3
1,Priya,29,Male,HR,33529,7,2022,3.8
2,Ravi,29,Female,Marketing,42262,7,2019,1.6
3,Priya,34,Male,HR,34268,2,2017,3.4
4,Priya,27,Male,HR,46271,0,2022,3.2
5,Amit,33,Female,HR,37185,7,2020,1.8
6,Ravi,32,Male,Marketing,88704,2,2017,4.8
7,Ravi,32,Female,HR,46243,2,2015,3.4
8,Ravi,29,Female,Finance,64099,0,2017,3.8
9,Priya,20,Female,Marketing,33571,4,2019,4.5
10,Sneha,22,Female,Finance,82836,9,2017,3.5
11,Ravi,24,Female,Marketing,64976,6,2015,2.2
12,Vikram,26,Female,HR,63044,9,2019,1.4
13,Priya,24,Female,Finance,76214,8,2021,2.8
14,Amit,21,Female,Marketing,86228,6,2021,1.9
15,Sneha,31,Female,IT,74216,8,2023,2.7
16,Vikram,26,Female,HR,73984,7,2017,4.5
17,Vikram,19,Female,Marketing,65774,1,2021,2.3
18,Amit,32,Male,IT,27568,0,2015,1.5
19,Sneha,24,Male,Marketing,79615,6,2018,2.4

In [9]:
df1.head(10)

,Name,Age,Gender,Department,Salary,Experience_Years,Joining_Year,Rating
0,Sneha,18,Female,HR,49300,0,2021,3.3
1,Priya,29,Male,HR,33529,7,2022,3.8
2,Ravi,29,Female,Marketing,42262,7,2019,1.6
3,Priya,34,Male,HR,34268,2,2017,3.4
4,Priya,27,Male,HR,46271,0,2022,3.2
5,Amit,33,Female,HR,37185,7,2020,1.8
6,Ravi,32,Male,Marketing,88704,2,2017,4.8
7,Ravi,32,Female,HR,46243,2,2015,3.4
8,Ravi,29,Female,Finance,64099,0,2017,3.8
9,Priya,20,Female,Marketing,33571,4,2019,4.5

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              20 non-null     object
 1   Age               20 non-null     int64
 2   Gender            20 non-null     object
 3   Department        20 non-null     object
 4   Salary            20 non-null     int64
 5   Experience_Years  20 non-null     int64
 6   Joining_Year      20 non-null     int64
 7   Rating            20 non-null     float64
dtypes: float64(1), int64(4), object(3)
memory usage: 1.4+ KB

In [11]:
df1.describe()

             Age        Salary  Experience_Years  Joining_Year     Rating
count  20.000000     20.000000         20.000000     20.000000  20.000000
mean   26.600000  58494.350000          4.550000   2018.800000   2.940000
std     4.967261  19944.653509          3.316228      2.504732   1.043476
min    18.000000  27568.000000          0.000000   2015.000000   1.400000
25%    23.500000  40992.750000          1.750000   2017.000000   2.125000
50%    26.500000  63571.500000          6.000000   2019.000000   3.000000
75%    31.250000  74715.500000          7.000000   2021.000000   3.575000
max    34.000000  88704.000000          9.000000   2023.000000   4.800000

In [13]:
df1.shape

(20, 8)

In [14]:
df1.columns

Index(['Name', 'Age', 'Gender', 'Department', 'Salary', 'Experience_Years',
       'Joining_Year', 'Rating'],
      dtype='object')

In [15]:
df1.isnull().sum()

Name                0
Age                 0
Gender              0
Department          0
Salary              0
Experience_Years    0
Joining_Year        0
Rating              0
dtype: int64

In [17]:
df1.dropna(inplace=True)

In [18]:
df1.fillna(0,inplace=True)

In [19]:
df1.sort_values('Age',ascending=True)

,Name,Age,Gender,Department,Salary,Experience_Years,Joining_Year,Rating
0,Sneha,18,Female,HR,49300,0,2021,3.3
17,Vikram,19,Female,Marketing,65774,1,2021,2.3
9,Priya,20,Female,Marketing,33571,4,2019,4.5
14,Amit,21,Female,Marketing,86228,6,2021,1.9
10,Sneha,22,Female,Finance,82836,9,2017,3.5
11,Ravi,24,Female,Marketing,64976,6,2015,2.2
19,Sneha,24,Male,Marketing,79615,6,2018,2.4
13,Priya,24,Female,Finance,76214,8,2021,2.8
12,Vikram,26,Female,HR,63044,9,2019,1.4
16,Vikram,26,Female,HR,73984,7,2017,4.5
4,Priya,27,Male,HR,46271,0,2022,3.2
1,Priya,29,Male,HR,33529,7,2022,3.8
8,Ravi,29,Female,Finance,64099,0,2017,3.8
2,Ravi,29,Female,Marketing,42262,7,2019,1.6
15,Sneha,31,Female,IT,74216,8,2023,2.7
6,Ravi,32,Male,Marketing,88704,2,2017,4.8
7,Ravi,32,Female,HR,46243,2,2015,3.4
18,Amit,32,Male,IT,27568,0,2015,1.5
5,Amit,33,Female,HR,37185,7,2020,1.8
3,Priya,34,Male,HR,34268,2,2017,3.4

In [24]:
df1.loc[12]

Name                Vikram
Age                     26
Gender              Female
Department              HR
Salary               63044
Experience_Years         9
Joining_Year          2019
Rating                 1.4
Name: 12, dtype: object

In [27]:
df1.iloc[0]

Name                 Sneha
Age                     18
Gender              Female
Department              HR
Salary               49300
Experience_Years         0
Joining_Year          2021
Rating                 3.3
Name: 0, dtype: object

In [44]:
e_min = df1.groupby('Department')['Salary'].min()
print(e_min)
print("total min salary:",sum(e_min))

Department
Finance      64099
HR           33529
IT           27568
Marketing    33571
Name: Salary, dtype: int64
total min salary: 158767

In [47]:
df1['Gender'].value_counts()

Gender
Female    14
Male       6
Name: count, dtype: int64

In [53]:
df1['Age'].apply(lambda x:x+1)

0     19
1     30
2     30
3     35
4     28
5     34
6     33
7     33
8     30
9     21
10    23
11    25
12    27
13    25
14    22
15    32
16    27
17    20
18    33
19    25
Name: Age, dtype: int64

In [51]:
df1

,Name,Age,Gender,Department,Salary,Experience_Years,Joining_Year,Rating
0,Sneha,18,Female,HR,49300,0,2021,3.3
1,Priya,29,Male,HR,33529,7,2022,3.8
2,Ravi,29,Female,Marketing,42262,7,2019,1.6
3,Priya,34,Male,HR,34268,2,2017,3.4
4,Priya,27,Male,HR,46271,0,2022,3.2
5,Amit,33,Female,HR,37185,7,2020,1.8
6,Ravi,32,Male,Marketing,88704,2,2017,4.8
7,Ravi,32,Female,HR,46243,2,2015,3.4
8,Ravi,29,Female,Finance,64099,0,2017,3.8
9,Priya,20,Female,Marketing,33571,4,2019,4.5
10,Sneha,22,Female,Finance,82836,9,2017,3.5
11,Ravi,24,Female,Marketing,64976,6,2015,2.2
12,Vikram,26,Female,HR,63044,9,2019,1.4
13,Priya,24,Female,Finance,76214,8,2021,2.8
14,Amit,21,Female,Marketing,86228,6,2021,1.9
15,Sneha,31,Female,IT,74216,8,2023,2.7
16,Vikram,26,Female,HR,73984,7,2017,4.5
17,Vikram,19,Female,Marketing,65774,1,2021,2.3
18,Amit,32,Male,IT,27568,0,2015,1.5
19,Sneha,24,Male,Marketing,79615,6,2018,2.4

In [63]:
tables = pd.ExcelFile('random_datasets.xlsx')
print(tables.sheet_names)

['Customers', 'Orders']

In [68]:
c_df = pd.read_excel('random_datasets.xlsx',sheet_name='Customers')
o_df = pd.read_excel('random_datasets.xlsx',sheet_name='Orders')

print(c_df)
print(o_df)

    id      name  age           city
0    1      John   25       New York
1    2     Alice   30    Los Angeles
2    3      Mike   22        Chicago
3    4      Sara   28        Houston
4    5     David   35        Phoenix
5    6      Emma   24   Philadelphia
6    7     Chris   29    San Antonio
7    8    Olivia   27      San Diego
8    9     James   32         Dallas
9   10    Sophia   26       San Jose
10  11    Daniel   29         Austin
11  12      Lily   23   Jacksonville
12  13     Ethan   31     Fort Worth
13  14     Chloe   27       Columbus
14  15      Ryan   34      Charlotte
15  16       Zoe   25  San Francisco
16  17     Lucas   26   Indianapolis
17  18       Mia   22        Seattle
18  19      Noah   28         Denver
19  20  Isabella   29         Boston
    id  order_amount     product
0    1           250      Laptop
1    2            60        Book
2    3           150  Headphones
3    4           300      Camera
4    5           500       Phone
5    6           120    Keyboard
6    7           200     Monitor
7    8           400  Smartwatch
8    9           220     Speaker
9   10            90       Mouse
10  11           330      Tablet
11  12           180      Router
12  13           270     Printer
13  14           320  Microphone
14  15           150     Charger
15  16            80       Cable
16  17           450   Projector
17  18           210         SSD
18  19           300      Camera
19  20           180      Tablet

In [70]:
merge_df = pd.merge(c_df,o_df, on='id')
print(merge_df)

    id      name  age           city  order_amount     product
0    1      John   25       New York           250      Laptop
1    2     Alice   30    Los Angeles            60        Book
2    3      Mike   22        Chicago           150  Headphones
3    4      Sara   28        Houston           300      Camera
4    5     David   35        Phoenix           500       Phone
5    6      Emma   24   Philadelphia           120    Keyboard
6    7     Chris   29    San Antonio           200     Monitor
7    8    Olivia   27      San Diego           400  Smartwatch
8    9     James   32         Dallas           220     Speaker
9   10    Sophia   26       San Jose            90       Mouse
10  11    Daniel   29         Austin           330      Tablet
11  12      Lily   23   Jacksonville           180      Router
12  13     Ethan   31     Fort Worth           270     Printer
13  14     Chloe   27       Columbus           320  Microphone
14  15      Ryan   34      Charlotte           150     Charger
15  16       Zoe   25  San Francisco            80       Cable
16  17     Lucas   26   Indianapolis           450   Projector
17  18       Mia   22        Seattle           210         SSD
18  19      Noah   28         Denver           300      Camera
19  20  Isabella   29         Boston           180      Tablet

In [71]:
merge_df.groupby('product')['order_amount'].sum()

product
Book           60
Cable          80
Camera        600
Charger       150
Headphones    150
Keyboard      120
Laptop        250
Microphone    320
Monitor       200
Mouse          90
Phone         500
Printer       270
Projector     450
Router        180
SSD           210
Smartwatch    400
Speaker       220
Tablet        510
Name: order_amount, dtype: int64

In [72]:
merge_df.loc[12]

id                      13
name                 Ethan
age                     31
city            Fort Worth
order_amount           270
product            Printer
Name: 12, dtype: object

In [73]:
merge_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            20 non-null     int64
 1   name          20 non-null     object
 2   age           20 non-null     int64
 3   city          20 non-null     object
 4   order_amount  20 non-null     int64
 5   product       20 non-null     object
dtypes: int64(3), object(3)
memory usage: 1.1+ KB

In [75]:
print(merge_df)

    id      name  age           city  order_amount     product
0    1      John   25       New York           250      Laptop
1    2     Alice   30    Los Angeles            60        Book
2    3      Mike   22        Chicago           150  Headphones
3    4      Sara   28        Houston           300      Camera
4    5     David   35        Phoenix           500       Phone
5    6      Emma   24   Philadelphia           120    Keyboard
6    7     Chris   29    San Antonio           200     Monitor
7    8    Olivia   27      San Diego           400  Smartwatch
8    9     James   32         Dallas           220     Speaker
9   10    Sophia   26       San Jose            90       Mouse
10  11    Daniel   29         Austin           330      Tablet
11  12      Lily   23   Jacksonville           180      Router
12  13     Ethan   31     Fort Worth           270     Printer
13  14     Chloe   27       Columbus           320  Microphone
14  15      Ryan   34      Charlotte           150     Charger
15  16       Zoe   25  San Francisco            80       Cable
16  17     Lucas   26   Indianapolis           450   Projector
17  18       Mia   22        Seattle           210         SSD
18  19      Noah   28         Denver           300      Camera
19  20  Isabella   29         Boston           180      Tablet

In [87]:
#drop = merge_df.drop(index=[0] , inplace=True)
print(merge_df)

    id      name  age           city  order_amount     product
1    2     Alice   30    Los Angeles            60        Book
2    3      Mike   22        Chicago           150  Headphones
3    4      Sara   28        Houston           300      Camera
4    5     David   35        Phoenix           500       Phone
5    6      Emma   24   Philadelphia           120    Keyboard
6    7     Chris   29    San Antonio           200     Monitor
7    8    Olivia   27      San Diego           400  Smartwatch
8    9     James   32         Dallas           220     Speaker
9   10    Sophia   26       San Jose            90       Mouse
10  11    Daniel   29         Austin           330      Tablet
11  12      Lily   23   Jacksonville           180      Router
12  13     Ethan   31     Fort Worth           270     Printer
13  14     Chloe   27       Columbus           320  Microphone
14  15      Ryan   34      Charlotte           150     Charger
15  16       Zoe   25  San Francisco            80       Cable
16  17     Lucas   26   Indianapolis           450   Projector
17  18       Mia   22        Seattle           210         SSD
18  19      Noah   28         Denver           300      Camera
19  20  Isabella   29         Boston           180      Tablet

In [91]:
merge_df.duplicated()

1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
dtype: bool

In [92]:
merge_df.to_csv()

',id,name,age,city,order_amount,product\r\n1,2,Alice,30,Los Angeles,60,Book\r\n2,3,Mike,22,Chicago,150,Headphones\r\n3,4,Sara,28,Houston,300,Camera\r\n4,5,David,35,Phoenix,500,Phone\r\n5,6,Emma,24,Philadelphia,120,Keyboard\r\n6,7,Chris,29,San Antonio,200,Monitor\r\n7,8,Olivia,27,San Diego,400,Smartwatch\r\n8,9,James,32,Dallas,220,Speaker\r\n9,10,Sophia,26,San Jose,90,Mouse\r\n10,11,Daniel,29,Austin,330,Tablet\r\n11,12,Lily,23,Jacksonville,180,Router\r\n12,13,Ethan,31,Fort Worth,270,Printer\r\n13,14,Chloe,27,Columbus,320,Microphone\r\n14,15,Ryan,34,Charlotte,150,Charger\r\n15,16,Zoe,25,San Francisco,80,Cable\r\n16,17,Lucas,26,Indianapolis,450,Projector\r\n17,18,Mia,22,Seattle,210,SSD\r\n18,19,Noah,28,Denver,300,Camera\r\n19,20,Isabella,29,Boston,180,Tablet\r\n'